# Задача 5. Даны два файла, в каждом из которых находится запись многочлена. 
# Задача - сформировать файл, содержащий сумму многочленов. 

 

o_1 =  '3*x**8+9*x**7+3*x**6+3*x**5+8*x**4+3*x**3+10*x**2+2*x+4'.split('+') 

  

o_2 = '6*x**8+10*x**7+7*x**5+10*x**4+7*x**3+5*x**2+10'.split('+') 

  

print(o_1 + o_2) 